Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	
	// Может быть: ДополнительнаяОбработка, ДополнительныйОтчет, ЗаполнениеОбъекта, Отчет, ПечатнаяФорма
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка"); 
	
	ПараметрыРегистрации.Вставить("Наименование", "Выделение НДС при переходе на ОСНО (2026)");
	ПараметрыРегистрации.Вставить("Версия", "1.1");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь); // Ложь, так как мы создаем документы и пишем в базу
	ПараметрыРегистрации.Вставить("Информация", "Обработка для автоматического выделения НДС и формирования вычетов при переходе с УСН на ОСНО.");
	
	// Описываем команды (в нашем случае одна - открытие формы)
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = "Открыть помощник перехода на ОСНО";
	НоваяКоманда.Идентификатор = "ОткрытьФорму"; // Имя команды
	НоваяКоманда.Использование = "ОткрытиеФормы"; // Тип запуска
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции