
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;

	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка"); 
	ПараметрыРегистрации.Вставить("Наименование", "Помощник перехода на ОСНО (выделение НДС)");
	ПараметрыРегистрации.Вставить("Версия", "1.2");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина); 
	
	ПараметрыРегистрации.Вставить("Информация", "Автоматизирует выделение НДС из остатков при переходе на ОСНО.");
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = "Открыть помощник перехода на ОСНО";
	НоваяКоманда.Идентификатор = "ОткрытьФорму"; 
	НоваяКоманда.Использование = "ОткрытиеФормы";
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	Разрешения = Новый Массив;
	ПараметрыРегистрации.Вставить("Разрешения", Разрешения);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции